Revit 2024 API
IFCFileFormat Enumeration
 The IFC file format.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum IFCFileFormat
Visual Basic
Public Enumeration IFCFileFormat
Visual C++
public enum class IFCFileFormat
Members
Member name | Description
Ifc |  IFC format.
IfcXML |  IFC-XML format.
IfcZIP |  IFC file, zipped to IFC-ZIP format.
IfcXMLZIP |  IFC-XML file, zipped to IFC-ZIP format.
See Also
Autodesk.Revit.DB.IFC Namespace